<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018/3/7
 * Time: 15:17
 */

namespace app\common;


class ReturnCode
{
    /**
     * @var array
     */
    static public $return_code = [
        // 1开头表示操作相关
        '1001' => '操作成功', // 10 开头表示操作成功
        '1002' => '操作失败',
        '1003' => '非法请求', //非法的请求方式 非ajax
        '1004' => '请求参数错误', //如参数不完整,类型不正确
        '1005' => '数据不存在', //
        '1006' => '数据加载失败', //
        '1007' => '数据模型不存在',
        //2 开头表示用户账号操作相关
        '2001' => '请先登陆再访问',
        '2002' => '用户账号或密码错误',
        '2003' => '用户账号被禁用',
        '2004' => '没有权限',
        '2005' => '登录失效',
        '2006' => '账号不能为空',
        '2007' => '密码不能为空',
        '2008' => '验证码不正确',
        '2009' => '账号已存在',
        '2010'=>  '账号重复',
        '2011'=> '账号在其他地方登录',
        '2012'=> '新密码不能为空',
        '2013' => '密码错误',
        '2014' => '登录失败，请重试',
        '2015' => '地址不存在，请重试',
        '2016' => '购物车为空，请重试',
        //3 开头表示验证规则
        '3001' => '手机号不正确',
        '3002' => '短信每日限定20条，请明日再试！',
        '3003' => '名称只允许汉字字母组合',
        '3004' => '缺少必填项',
        '3005' => '非法参数',
        '3006'=> '账号密码必须为6-16位数字字母组合',
        '3007'=> '昵称不能为空',
        '3008'=> '昵称只能是汉字、字母、数字和下划线_及破折号-组合',
        '3009'=> '头像非法',
        //4 开头文件相关
        '4001' => '文件上传成功！',
        '4002' => '文件上传失败，请重试！',
        //5 杂项
        '5001' => '请先清空下级！',
        '5002' => '超过限定值!',
        '5003' => '数据不存在，请重试！',
        //6 微信小程序相关
        '6001' => '微信服务器请求失败',
    ];
}